// src/pages/DetailsPage.tsx
import React from "react";
import { useSelector } from "react-redux";
import { RootState } from "../../app/store";

import styles from "./Prayers.module.css";

const PrayerElMaleRahamim: React.FC = () => {
  const formData = useSelector((state: RootState) => state.izkor);

  if (formData.gender === "female" && formData.version === "sephardic")
    return (
      <div className={styles.page}>
        <p className={styles.instructions}>תפילת אל מלא רחמים</p>
        <p className={styles.instructions}>השכבה לאשה</p>
        <p className={styles.text}>
          אֵשֶׁת חַיִל מִי יִמְצָא, וְרָחֹק מִפְּנִינִים מִכְרָהּ: שֶׁקֶר הַחֵן
          וְהֶבֶל הַיֹּפִי, אִשָּׁה יִרְאַת אֲדֹנָי הִיא תִתְהַלָּל: תְּנוּ לָהּ
          מִפְּרִי יָדֶיהָ, וִיהַלְלוּהָ בַשְּׁעָרִים מַעֲשֶׂיהָ: רַחֲמָנָא
          דְּרַחֲמָנוּתָא דִי לֵיהּ הִיא וּבְמֵימְרֵיהּ אִתְבְּרִיאוּ עָלְמַיָּא
          עַלְמָא הָדֵין וְעַלְמָא דְּאָתֵי וּגְנַז בֵּיהּ צַדְקָנִיּוֹת
          וְחַסְדָּנִיּוֹת דְּעַבְדָן רְעוּתֵיהּ וּבְמֵימְרֵיהּ וּבִיקָרֵיהּ
          וּבְתוּקְפֵיהּ יֵאמַר לְמֵיעַל קֳדָמוֹהִי דּוּכְרָן נֶפֶשׁ הָאִשָּׁה
          הַכְּבוּדָה וְהַצְּנוּעָה וְהַנִּכְבֶּדֶת מָרַת {formData.firstName}{" "}
          רוּחַ אֲדֹנָי תְּנִיחֶנָּה בְּגַן עֵדֶן. דְּאִתְפְּטָרַת מִן עַלְמָא
          הָדֵין כִּרְעוּת אֱלָהָא מָרֵיהּ שְׁמַיָּא וְאַרְעָא. הַמֶּלֶךְ
          בְּרַחֲמָיו יָחוֹס וְיַחְמוֹל עָלֶיהָ. וְיִלָּוֶה אֵלֶיהָ הַשָּׁלוֹם
          וְעַל מִשְׁכָּבָה יִהְיֶה שָׁלוֹם. כְּדִכְתִיב: יָבוֹא שָׁלוֹם
          יָנוּחוּ עַל מִשְׁכְּבוֹתָם. הֹלֵךְ נְכֹחוֹ. הִיא וְכָל בְּנוֹת
          יִשְׂרָאֵל הַשּׁוֹכְבוֹת עִמָּהּ בִּכְלַל הָרַחֲמִים וְהַסְּלִיחוֹת.
          וְכֵן יְהִי רָצוֹן וְנֹאמַר אָמֵן.
        </p>
      </div>
    );
  else if (formData.gender === "male" && formData.version === "sephardic")
    return (
      <div className={styles.page}>
        <p className={styles.instructions}>תפילת אל מלא רחמים</p>
        <p className={styles.instructions}>השכבה לגבר</p>
        <p className={styles.text}>
          מְנוּחָה נְכוֹנָה. בִּישִׁיבָה עֶלְיוֹנָה. בְּמַעֲלַת קְדוֹשִׁים
          וּטְהוֹרִים. כְּזוֹהַר הָרָקִיעַ מְאִירִים וּמַזְהִירִים. וְחִלּוּץ
          עֲצָמִים. וְכַפָּרַת אֲשָׁמִים. וְהַרְחָקַת פֶּשַׁע. וְהַקְרָבַת
          יֶשַׁע. וְחֶמְלָה וַחֲנִינָה. מִלִּפְנֵי שׁוֹכֵן מְעוֹנָה. וְחוּלָקָא
          טָבָא. לְחַיֵּי הָעוֹלָם הַבָּא. שָׁם תְּהֵא מְנַת וּמְחִיצַת
          וִישִׁיבַת נֶפֶשׁ הַשֵּׁם הַטּוֹב הַמְּרוּחָם {formData.firstName}{" "}
          רוּחַ אֲדֹנָי תְּנִיחֶנּוּ בְּגַן עֵדֶן. דְּאִתְפְּטָר מִן עַלְמָא
          הָדֵין כִּרְעוּת אֱלָהָא מָארֵיהּ שְׁמַיָּא וְאַרְעָא. מֶלֶךְ מַלְכֵי
          הַמְּלָכִים בְּרַחֲמָיו יְרַחֵם עָלָיו. וְיָחוֹס וְיַחְמוֹל עָלָיו.
          מֶלֶךְ מַלְכֵי הַמְּלָכִים בְּרַחֲמָיו יַסְתִּירֵהוּ בְּצֵל כְּנָפָיו
          וּבְסֵתֶר אָהֳלוֹ לַחֲזוֹת בְּנוֹעַם אֲדֹנָי וּלְבַקֵּר בְּהֵיכָלוֹ.
          וּלְקֵץ הַיָּמִין יַעֲמִידֵהוּ. וּמִנַּחַל עֲדָנָיו יַשְׁקֵהוּ.
          וְיִצְרוֹר בִּצְרוֹר הַחַיִּים נִשְׁמָתוֹ. וְיָשִׂים כָּבוֹד
          מְנוּחָתוֹ. אֲדֹנָי הוּא נַחֲלָתוֹ. וְיִלָּוֶה אֵלָיו הַשָּׁלוֹם וְעַל
          מִשְׁכָּבוֹ יִהְיֶה שָׁלוֹם. כְּדִכְתִיב: יָבוֹא שָׁלוֹם יָנוּחוּ עַל
          מִשְׁכְּבוֹתָם. הֹלֵךְ נְכֹחוֹ. הוּא וְכָל בְּנֵי יִשְׂרָאֵל
          הַשּׁוֹכְבִים עִמּוֹ בִּכְלַל הָרַחֲמִים וְהַסְּלִיחוֹת. וְכֵן יְהִי
          רָצוֹן וְנֹאמַר אָמֵן".
        </p>
      </div>
    );
  if (formData.gender === "female" && formData.version === "ashkenazic")
    // אשכנז אישה
    return (
      <div className={styles.page}>
        <p className={styles.instructions}>תפילת אל מלא רחמים</p>
        <p className={styles.instructions}>השכבה לאישה</p>
        <p className={styles.text}>
          השכבה לאשה אֵל מָלֵא רַחֲמִים שׁוֹכֵן בַּמָּרוֹמִים, הַמְצֵא מְנוּחָה
          נְכוֹנָה תַּחַת כַּנְפֵי הַשְּׁכִינָה בְּמַעֲלוֹת קְדוֹשִים
          וּטְהוֹרִים כְּזוֹהַר הָרָקִיעַ מַזְהִירִים אֶת נִשְׁמַת{" "}
          {formData.firstName} בת {formData.parentName} שֶׁהָלֶכָה לְעוֹלָמָהּ,
          בַּעֲבוּר (שם תורם) נָדַב צְדָקָה בְּעַד הַזְכָּרַת נִשְׁמָתָהּ,
          בְּגַן עֵדֶן תְּהֵא מְנוּחָתָה. לָכֵן בַּעַל הָרַחֲמִים יַסְתִּירֶהָ
          בְּסֵתֶר כְּנָפָיו לְעוֹלָמִים, וְיִצְרוֹר בִּצְרוֹר הַחַיִּים אֶת
          נִשְׁמָתָהּ יְיָ הוּא נַחֲלָתָהּ, וְתָנוּחַ בְּשָׁלוֹם עַל
          מִשְׁכָּבָהּ וְנֹאמַר אָמֵן:
        </p>
      </div>
    );
  // default (formData.gender === "male" && formData.version === "ashkenazic")
  else
    return (
      <div className={styles.page}>
        <p className={styles.instructions}>תפילת אל מלא רחמים</p>
        <p className={styles.instructions}>השכבה לגבר</p>
        <p className={styles.text}>
          אֵל מָלֵא רַחֲמִים שׁוֹכֵן בַּמָּרוֹמִים, הַמְצֵא מְנוּחָה נְכוֹנָה
          תַּחַת כַּנְפֵי הַשְּׁכִינָה בְּמַעֲלוֹת קְדוֹשִים וּטְהוֹרִים
          כְּזוֹהַר הָרָקִיעַ מַזְהִירִים אֶת נִשְׁמַת {formData.firstName} בן{" "}
          {formData.parentName}, שֶׁהָלַךְ לְעוֹלָמוֹ בַּעֲבוּר ש (שם תורם)
          נָדַב צְדָקָה בְּעַד הַזְכָּרַת נִשְׁמָתוֹ. בְּגַן עֵדֶן תְּהֵא
          מְנוּחָתוֹ. לָכֵן בַּעַל הָרַחֲמִים יַסְתִּירֵהוּ בְּסֵתֶר כְּנָפָיו
          לְעוֹלָמִים, וְיִצְרוֹר בִּצְרוֹר הַחַיִּים אֶת נִשְׁמָתוֹ. יְיָ הוּא
          נַחֲלָתוֹ וְיָנוּחַ בְּשָׁלוֹם עַל מִשְׁכָּבוֹ, וְנֹאמַר אָמֵן:
        </p>
      </div>
    );
};
export default PrayerElMaleRahamim;
