// src/pages/DetailsPage.tsx
import React from "react";

import styles from "./Prayers.module.css";

const PrayerThilimLG: React.FC = () => {
  return (
    <div className={styles.page}>
      <p className={styles.instructions}>פרקי תהילים</p>
      <p className={styles.instructions}>תהילים לג</p>
      <p className={styles.text}>
        רַנְּנוּ צַדִּיקִים בַּיָי לַיְשָׁרִים נָאוָה תְהִלָּה: הוֹדוּ לַיָי
        בְּכִנּוֹר בְּנֵבֶל עָשׂוֹר זַמְּרוּ לוֹ: שִׁירוּ לוֹ שִׁיר חָדָשׁ
        הֵיטִיבוּ נַגֵּן בִּתְרוּעָה: כִּי יָשָׁר דְּבַר יְיָ וְכָל מַעֲשֵׂהוּ
        בֶּאֱמוּנָה: אֹהֵב צְדָקָה וּמִשְׁפָּט חֶסֶד יְיָ מָלְאָה הָאָרֶץ:
        בִּדְבַר יְיָ שָׁמַיִם נַעֲשׂוּ וּבְרוּחַ פִּיו כָּל צְבָאָם: כֹּנֵס
        כַּנֵּד מֵי הַיָּם נֹתֵן בְּאוֹצָרוֹת תְּהוֹמוֹת: יִירְאוּ מֵיְיָ כָּל
        הָאָרֶץ מִמֶּנּוּ יָגוּרוּ כָּל יֹשְׁבֵי תֵבֵל: כִּי הוּא אמַר וַיֶּהִי
        הוא צִוָּה וַיַּעֲמֹד: יְיָ הֵפִיר עֲצַת גּוֹיִם הֵנִיא מַחְשְׁבוֹת
        עַמִּים: עֲצַת יְיָ לְעוֹלָם תַּעֲמֹד מַחְשְׁבוֹת לִבּוֹ לְדֹר וָדֹר:
        אַשְׁרֵי הַגּוֹי אֲשֶׁר יְיָ אֱלֹהָיו הָעָם בָּחַר לְנַחֲלָה לוֹ:
        מִשָּׁמַיִם הִבִּיט יְיָ רָאה אֶת כָּל בְּנֵי הָאָדָם: מִמְּכוֹן
        שִׁבְתּוֹ הִשְׁגִּיחַ אֶל כָּל יֹשְׁבֵי הָאָרֶץ: הַיֹּצֵר יַחַד לִבָּם
        הַמֵּבִין אֶל כָּל מַעֲשֵׂיהֶם: אֵין הַמֶּלֶךְ נוֹשָׁע בְּרָב חָיִל
        גִּבּוֹר לֹא יִנָּצֵל בְּרָב כֹּחַ: שֶׁקֶר הַסּוּס לִתְשׁוּעָה וּבְרֹב
        חֵילוֹ לֹא יְמַלֵּט: הִנֵּה עֵין יְיָ אֶל יְרֵאָיו לַמְיַחֲלִים
        לְחַסְדּוֹ: לְהַצִּיל מִמָּוֶת נַפְשָׁם וּלְחַיּוֹתָם בָּרָעָב:
        נַפְשֵׁנוּ חִכְּתָה לַיָי עֶזְרֵנוּ וּמָגִנֵּנוּ הוּא: כִּי בוֹ יִשְׂמַח
        לִבֵּנוּ כִּי בְשֵׁם קָדְשׁוֹ בָטָחְנוּ: יְהִי חַסְדְּךָ יְיָ עָלֵינוּ
        כַּאֲשֶׁר יִחַלְנוּ לָךְ:
      </p>
    </div>
  );
};
export default PrayerThilimLG;
