import { Box } from "@mui/material";
import styles from "./Prayers.module.css";

export const PRAYER_START = `בָּרוּךְ אַתָּה יְיָ, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר יָצַר אֶתְכֶם בַּדִּין, וְזָן וְכִלְכֵּל אֶתְכֶם בַּדִּין, וְהֵמִית אֶתְכֶם בַּדִּין,
וְיוֹדֵעַ מִסְפַּר כֻּלְּכֶם בַּדִּין, וְעָתִיד לְהַחֲזִיר וּלְהַחֲיוֹתְכֶם בַּדִּין: בָּרוּךְ אַתָּה יְיָ, מְחַיֵּה הַמֵּתִים:
אַתָּה גִּבּוֹר לְעוֹלָם, אֲדֹנָי מְחַיֵּה מֵתִים אַתָּה, רַב
לְהוֹשִׁיעַ. מְכַלְכֵּל חַיִּים בְּחֶסֶד, מְחַיֵּה מֵתִים בְּרַחֲמִים
רַבִּים, סוֹמֵךְ נוֹפְלִים, וְרוֹפֵא חוֹלִים, וּמַתִּיר אֲסוּרִים,
וּמְקַיֵּם אֱמוּנָתוֹ לִישֵׁנֵי עָפָר. מִי כָמוֹךָ בַּעַל גְּבוּרוֹת
וּמִי דּוֹמֶה לָּךְ, מֶלֶךְ מֵמִית וּמְחַיֶּה וּמַצְמִיחַ יְשׁוּעָה.
וְנֶאֱמָן אַתָּה לְהַחֲיוֹת מֵתִים.`;

const PrayerStart: React.FC = () => {
  return (
    <Box sx={{ py: 4, px: 2 }} dir="rtl">
      <p
        className={styles.instructions}
        style={{
          fontStyle: "italic",
          textAlign: "center",
          fontWeight: "normal",
          marginBottom: "16px"
        }}
      >
        מי שלא היה בבית קברות במשך שלושים יום מברך ברכה זו בבואו תוך ד' אמות
      </p>
      <p className={styles.text} style={{ whiteSpace: "pre-line" }}>
        {PRAYER_START}
      </p>
    </Box>
  );
};

export default PrayerStart;
