// src/pages/DetailsPage.tsx
import React from "react";
import { useSelector } from "react-redux";
import { RootState } from "../../app/store";
import styles from "./Prayers.module.css";

const PrayerKadhshYatom: React.FC = () => {
  const formData = useSelector((state: RootState) => state.izkor);

  if (formData.version === "sephardic")
    return (
      <div className={styles.page}>
        <p className={styles.instructions}>קדיש יתום</p>
        <p className={styles.text}>
          קדיש יתום יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. אמן בְּעָלְמָא
          דִּי בְרָא כִרְעוּתֵהּ וְיַמְלִיךְ מַלְכוּתֵהּ וְיַצְמַח פֻּרְקָנֵהּ
          וִיקָרֵב מְשִׁיחֵהּ. אמן בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל
          בֵּית יִשְֹרָאֵל בַּעֲגָלָא וּבִזְמַן קָרִיב וְאִמְרוּ אָמֵן: אמן
          יְהֵא שׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם לְעָלְמֵי עָלְמַיָּא, יִתְבָּרַךְ
          וְיִשְתַּבַּח וְיִתְפָּאַר וְיִתְרוֹמַם וְיִתְנַשֵֹּא וְיִתְהַדָּר
          וְיִתְעַלֶּה וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא בְּרִיךְ הוּא. אמן
          לְעֵלָּא מִן כָּל בִּרְכָתָא שִׁירָתָא תִּשְׁבְּחָתָא וְנֶחָמָתָא
          דַּאֲמִירָן בְּעָלְמָא וְאִמְרוּ אָמֵן: אמן יְהֵא שְׁלָמָה רבָּא מִן
          שְׁמַיָּא, חַיִּים וְשָֹבָע וִישׁוּעָה וְנֶחָמָה וְשֵיזָבָה וּרְפוּאָה
          וּגְאֻלָּה וּסְלִיחָה וְכַפָּרָה, וְרֵיוַח וְהַצָּלָה לָנוּ וּלְכָל
          עַמּוֹ יִשְֹרָאֵל וְאִמְרוּ אָמֵן: עוֹשֶֹה שָׁלוֹם בִּמְרוֹמָיו, הוּא
          בְּרַחֲמָיו יַעֲשֶֹה שָׁלוֹם עָלֵינוּ, וְעַל כָּל עַמּוֹ יִשְֹרָאֵל
          וְאִמְרוּ אָמֵן:
        </p>
      </div>
    );
  else
    return (
      <div className={styles.page}>
        <p className={styles.instructions}>קדיש יתום</p>
        <p className={styles.text}>
          יִתְגַּדַּל וְיִתְקַּדַּשׁ שְׁמֵהּ רַבָּא, בְּעָלְמָא דִּי בְרָא
          כִרְעוּתֵהּ, וְיַמְלִיךְ מַלְכוּתֵהּ בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן
          וּבְחַיֵּי דְכָל-בֵּית-יִשְׁרָאֵל. בַּעֲגָלָא וּבִזְמַן קָרִיב.
          וְאִמְרוּ אָמֵן: יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ, לְעָלַם וּלְעָלְמֵי
          עָלְמַיָּא. יִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרֹמַם
          וְיִתְנַשֵֹּא וְיִתְהַדַּר וְיִתְעַלֶּה וְיִתְהַלַּל שְׁמֵהּ
          דְּקֻדְשָׁא. בְּרִיךְ הוּא לְעֵלָּא (וּלְעֵלָּא) מִן-כָּל-בִּרְכָתָא
          וְשִׁירָתָא, תֻּשְׁבְּחָתָא וְנֶחְמָתָא, דַּאֲמִירָן בְּעָלְמָא.
          וְאִמְרוּ אָמֵן: יְהֵא שְׁלָמָא רַבָּא מִן-שְׁמַיָּא וְחַיִּים,
          עָלֵינוּ וְעַל-כָּל-יִשְֹרָאֵל. וְאמְרוּ אָמֵן: עֹשֶֹה שָׁלוֹם
          בִּמְרוֹמָיו, הוּא יַעֲשֶֹה שָׁלוֹם עָלֵינוּ וְעַל-כָּל-יִשְֹרָאֵל.
          וְאִמְרוּ אָמֵן:
        </p>
      </div>
    );
};
export default PrayerKadhshYatom;
